---
kind: other
id: Properties.T:Autodesk.Revit.DB.StdPostedWarning
source: html/9b63ad0c-5a81-4615-ea03-f93944993a97.htm
---
# StdPostedWarning Properties

Specifies whether the .NET object represents a valid Revit entity.